Revit 2026 API

# Definitions Methods

---

The Definitions type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Contains | Tests for the existence of a definition within the set. |
|  | Create | Creates a new parameter definition using specified options. |
|  | Dispose |  |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetBasicIEnumerator | Returns an enumerator that iterates through a collection. |
|  | GetEnumerator | Retrieves an enumerator to the collection. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Definitions Class

Autodesk.Revit.DB Namespace